

. d wrkslf
d wrkslf

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------
wrkslf          byte    %8.0g      LABD       r self-emp or works for somebody

. di "(Are/Were) you self employed or (do/did) you work for someone else?" 
di "(Are/Were) you self employed or (do/did) you work for someone else?" 
(Are/Were) you self employed or (do/did) you work for someone else?

. 

. ta  year wrkslf
ta  year wrkslf

           |  r self-emp or works
           |     for somebody
      year |         0  self-empl |     Total
-----------+----------------------+----------
      1972 |     1,299        149 |     1,448 
      1973 |     1,199        148 |     1,347 
      1974 |     1,238        116 |     1,354 
      1975 |     1,205        143 |     1,348 
      1976 |     1,215        137 |     1,352 
      1977 |     1,285        131 |     1,416 
      1978 |     1,264        140 |     1,404 
      1980 |     1,174        168 |     1,342 
      1982 |     1,545        186 |     1,731 
      1983 |     1,320        168 |     1,488 
      1984 |     1,210        170 |     1,380 
      1985 |     1,260        193 |     1,453 
      1986 |     1,183        187 |     1,370 
      1987 |     1,531        187 |     1,718 
      1988 |     1,227        163 |     1,390 
      1989 |     1,248        171 |     1,419 
      1990 |     1,149        150 |     1,299 
      1991 |     1,258        157 |     1,415 
      1993 |     1,331        187 |     1,518 
      1994 |     2,508        339 |     2,847 
      1996 |     2,387        365 |     2,752 
      1998 |     2,332        323 |     2,655 
      2000 |     2,331        307 |     2,638 
      2002 |     2,362        307 |     2,669 
      2004 |     2,353        343 |     2,696 
      2006 |     3,799        508 |     4,307 
      2008 |     1,732        226 |     1,958 
      2010 |     1,706        234 |     1,940 
      2012 |     1,700        194 |     1,894 
      2014 |     2,145        295 |     2,440 
      2016 |     2,472        296 |     2,768 
-----------+----------------------+----------
     Total |    51,968      6,788 |    58,756 


. ta  year wrkslf, row
ta  year wrkslf, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  r self-emp or works
           |     for somebody
      year |         0  self-empl |     Total
-----------+----------------------+----------
      1972 |     1,299        149 |     1,448 
           |     89.71      10.29 |    100.00 
-----------+----------------------+----------
      1973 |     1,199        148 |     1,347 
           |     89.01      10.99 |    100.00 
-----------+----------------------+----------
      1974 |     1,238        116 |     1,354 
           |     91.43       8.57 |    100.00 
-----------+----------------------+----------
      1975 |     1,205        143 |     1,348 
           |     89.39      10.61 |    100.00 
-----------+----------------------+----------
      1976 |     1,215        137 |     1,352 
           |     89.87      10.13 |    100.00 
-----------+----------------------+----------
      1977 |     1,285        131 |     1,416 
           |     90.75       9.25 |    100.00 
-----------+----------------------+----------
      1978 |     1,264        140 |     1,404 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
      1980 |     1,174        168 |     1,342 
           |     87.48      12.52 |    100.00 
-----------+----------------------+----------
      1982 |     1,545        186 |     1,731 
           |     89.25      10.75 |    100.00 
-----------+----------------------+----------
      1983 |     1,320        168 |     1,488 
           |     88.71      11.29 |    100.00 
-----------+----------------------+----------
      1984 |     1,210        170 |     1,380 
           |     87.68      12.32 |    100.00 
-----------+----------------------+----------
      1985 |     1,260        193 |     1,453 
           |     86.72      13.28 |    100.00 
-----------+----------------------+----------
      1986 |     1,183        187 |     1,370 
           |     86.35      13.65 |    100.00 
-----------+----------------------+----------
      1987 |     1,531        187 |     1,718 
           |     89.12      10.88 |    100.00 
-----------+----------------------+----------
      1988 |     1,227        163 |     1,390 
           |     88.27      11.73 |    100.00 
-----------+----------------------+----------
      1989 |     1,248        171 |     1,419 
           |     87.95      12.05 |    100.00 
-----------+----------------------+----------
      1990 |     1,149        150 |     1,299 
           |     88.45      11.55 |    100.00 
-----------+----------------------+----------
      1991 |     1,258        157 |     1,415 
           |     88.90      11.10 |    100.00 
-----------+----------------------+----------
      1993 |     1,331        187 |     1,518 
           |     87.68      12.32 |    100.00 
-----------+----------------------+----------
      1994 |     2,508        339 |     2,847 
           |     88.09      11.91 |    100.00 
-----------+----------------------+----------
      1996 |     2,387        365 |     2,752 
           |     86.74      13.26 |    100.00 
-----------+----------------------+----------
      1998 |     2,332        323 |     2,655 
           |     87.83      12.17 |    100.00 
-----------+----------------------+----------
      2000 |     2,331        307 |     2,638 
           |     88.36      11.64 |    100.00 
-----------+----------------------+----------
      2002 |     2,362        307 |     2,669 
           |     88.50      11.50 |    100.00 
-----------+----------------------+----------
      2004 |     2,353        343 |     2,696 
           |     87.28      12.72 |    100.00 
-----------+----------------------+----------
      2006 |     3,799        508 |     4,307 
           |     88.21      11.79 |    100.00 
-----------+----------------------+----------
      2008 |     1,732        226 |     1,958 
           |     88.46      11.54 |    100.00 
-----------+----------------------+----------
      2010 |     1,706        234 |     1,9
40 
           |     87.94      12.06 |    100.00 
-----------+----------------------+----------
      2012 |     1,700        194 |     1,894 
           |     89.76      10.24 |    100.00 
-----------+----------------------+----------
      2014 |     2,145        295 |     2,440 
           |     87.91      12.09 |    100.00 
-----------+----------------------+----------
      2016 |     2,472        296 |     2,768 
           |     89.31      10.69 |    100.00 
-----------+----------------------+----------
     Total |    51,968      6,788 |    58,756 
           |     88.45      11.55 |    100.00 


. 
. ta year dec
ta year dec


           |                     dec
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1972 |     1,613          0          0          0 |     1,613 
      1973 |     1,504          0          0          0 |     1,504 
      1974 |     1,484          0          0          0 |     1,484 
      1975 |     1,490          0          0          0 |     1,490 
      1976 |     1,499          0          0          0 |     1,499 
      1977 |     1,529          0          0          0 |     1,529 
      1978 |     1,532          0          0          0 |     1,532 
      1980 |         0      1,468          0          0 |     1,468 
      1982 |         0      1,860          0          0 |     1,860 
      1983 |         0      1,599          0          0 |     1,599 
      1984 |         0      1,473          0          0 |     1,473 
      1985 |         0      1,534          0          0 |     1,534 
      1986 |         0      1,470          0          0 |     1,470 
      1987 |         0      1,819          0          0 |     1,819 
      1988 |         0      1,481          0          0 |     1,481 
      1989 |         0      1,537          0          0 |     1,537 
      1990 |         0          0      1,372          0 |     1,372 
      1991 |         0          0      1,517          0 |     1,517 
      1993 |         0          0      1,606          0 |     1,606 
      1994 |         0          0      2,992          0 |     2,992 
      1996 |         0          0      2,904          0 |     2,904 
      1998 |         0          0      2,832          0 |     2,832 
      2000 |         0          0          0      2,817 |     2,817 
      2002 |         0          0          0      2,765 |     2,765 
      2004 |         0          0          0      2,812 |     2,812 
      2006 |         0          0          0      4,510 |     4,510 
      2008 |         0          0          0      2,023 |     2,023 
      2010 |         0          0          0      2,044 |     2,044 
      2012 |         0          0          0      1,974 |     1,974 
-----------+--------------------------------------------+----------
     Total |    10,651     14,241     13,223     18,945 |    57,060 


. 
. table dec wrkslf, c(mean swb) format(%9.2f)
table dec wrkslf, c(mean swb) format(%9.2f)
table year wrkslf, c(mean swb) format(%9.2f) 


------------------------------------------------------------------------------
       |                   r self-emp or works for somebody                   
   dec |             0 self-employed            .d            .i            NA
-------+----------------------------------------------------------------------
     1 |          2.21          2.29                        2.18          2.00
     2 |          2.19          2.27                        2.15          2.18
     3 |          2.19          2.26                        2.07          2.09
     4 |          2.17          2.21          2.00          2.07          2.32
------------------------------------------------------------------------------

. table year wrkslf, c(mean swb) format(%9.2f) 
*//meh nothig

------------------------------------------------------------------------------
       |                   r self-emp or works for somebody                   
  year |             0 self-employed            .d            .i            NA
-------+----------------------------------------------------------------------
  1972 |          2.13          2.22                        2.17          1.00
  1973 |          2.23          2.30                        2.16          2.20
  1974 |          2.24          2.34                        2.21          2.00
  1975 |          2.20          2.23                        2.14          2.00
  1976 |          2.22          2.21                        2.19          2.50
  1977 |          2.22          2.42                        2.14              
  1978 |          2.24          2.33                        2.25          2.00
  1980 |          2.21          2.27                        2.11          2.29
  1982 |          2.16          2.23                        2.06          1.86
  1983 |          2.19          2.26                        1.97          2.33
  1984 |          2.20          2.35                        2.19          2.00
  1985 |          2.16          2.23                        2.21              
  1986 |          2.20          2.22                        2.33              
  1987 |          2.15          2.24                        2.16          2.00
  1988 |          2.24          2.36                        2.16          1.83
  1989 |          2.23          2.25                        2.22          2.33
  1990 |          2.24          2.30                        2.14          2.00
  1991 |          2.20          2.27                        2.09          1.80
  1993 |          2.20          2.31                        2.06          2.38
  1994 |          2.17          2.21                        2.05          2.18
  1996 |          2.18          2.25                        2.07          2.16
  1998 |          2.20          2.26                        2.04          1.97
  2000 |          2.21          2.28                        2.09          2.38
  2002 |          2.18          2.17          2.00          2.09          2.00
  2004 |          2.18          2.17          2.00          2.15              
  2006 |          2.17          2.26          2.00          2.10          2.14
  2008 |          table dec wrkslf if city250k==1, c(mean swb) format(%9.2f) 
2.13          2.24                        2.05          1.00
  2010 |          2.12          2.12          2.00          1.93          2.75
  2012 |          2.16          2.14          2.00          2.14          2.00
  2014 |          2.17          2.24          2.50          2.19          1.67
  2016 |          2.13          2.16          1.75          1.90          2.50
------------------------------------------------------------------------------

. 
. *//meh nothig

. table dec wrkslf if city250k==1, c(mean swb) format(%9.2f) 

------------------------------------------------------------------------------
       |                   r self-emp or works for somebody                   
   dec |             0 self-employed            .d            .i            NA
-------+----------------------------------------------------------------------
     1 |          2.08          2.26                        2.11          1.78
     2 |          2.11          2.19                        2.04          1.83
     3 |          table dec wrkslf if city250k==0, c(mean swb) format(%9.2f)  
2.10          2.14                        1.97          2.02
     4 |          2.10          2.16          3.00          2.08          2.31
------------------------------------------------------------------------------

. table dec wrkslf if city250k==0, c(mean swb) format(%9.2f)  

ta  isco1 wrkslf

------------------------------------------------------------------------------
       |                   r self-emp or works for somebody                   
   dec |             0 self-employed            .d            .i            NA
-------+----------------------------------------------------------------------
     1 |          2.24          2.30                        2.20          2.12
     2 |          2.21          2.28                        2.18          2.27
     3 |          2.21          2.28                        2.10          2.14
     4 |          2.18          2.22          1.88          2.07          2.33
------------------------------------------------------------------------------

. 
. ta  isco1 wrkslf

                      |  r self-emp or works
                      |     for somebody
   1 digit occupation |         0  self-empl |     Total
----------------------+----------------------+----------
         professional |     4,167        945 |     5,112 
administrative/manage |     5,966        716 |     6,682 
             clerical |     4,072        640 |     4,712 
                sales |     5,270        160 |     5,430 
              service |     4,606        602 |     5,208 
           agriculure |       149        240 |       389 
 production,transport |     3,244        591 |     3,835 
     craft, technical |     6,299        631 |     6,930 
----------------------+----------------------+----------
                Total |    33,773      4,525 |    38,298 


. 

. *//aha so:
*//aha so:

. *//profrssional, production/transport aint good
*//profrssional, production/transport aint good

. table isco1 wrkslf, c(mean swb) format(%9.2f) 
table isco1 wrkslf, c(mean swb) format(%9.2f) 

-----------------------------------------------------------------------
                          |      r self-emp or works for somebody      
       1 digit occupation |             0  self-employed             .d
--------------------------+--------------------------------------------
             professional |          2.25           2.27               
administrative/managerial |          2.27           2.31           2.00
                 clerical |          2.21           2.27           2.00
                    sales |          2.16           2.31               
                  service |          2.14           2.21           2.20
               agriculure |          2.12           2.25               
     production,transport |          2.15           2.17               
         craft, technical |          2.08           2.12               
-----------------------------------------------------------------------

--------------------------------------------------------
                          |   r self-emp or works for   
                          |           somebody          
       1 digit occupation |            .i             NA
--------------------------+-----------------------------
             professional |                         2.25
administrative/managerial |                         2.38
                 clerical |                         2.10
                    sales |                         2.22
                  service |                         2.19
               agriculure |                         2.00
     production,transport |                         2.04
         craft, technical |          3.00           2.19
--------------------------------------------------------

. 

. 

. **** regressions
**** regressions

. 

. loc socDem age age2  mar  ed  male hompop white
loc socDem age age2  mar  ed  male hompop white

. loc extCon i.isco1 i.region
loc extCon i.isco1 i.region

. 

. reg swb wrkslf,beta robust
reg swb wrkslf,beta robust

Linear regression                               Number of obs     =     54,213
                                                F(1, 54211)       =      52.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0010
                                                Root MSE          =     .63433

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.06       0.01     7.27    0.00                     0.03
       _cons |       2.18       0.00   754.13    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc,beta robust
reg swb wrkslf realinc,beta robust
reg swb wrkslf realinc `socDem',beta robust

Linear regression                               Number of obs     =     49,163
                                                F(2, 49160)       =     768.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0297
                                                Root MSE          =     .62291

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.03       0.01     2.83    0.00                     0.01
     realinc |       3.72       0.10    38.61    0.00                     0.17
       _cons |       2.07       0.00   476.28    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem',beta robust

Linear regression                               Number of obs     =     49,014
                                                F(9, 49004)       =     467.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0789
                                                Root MSE          =     .60686

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     2.04    0.04                     0.01
     realinc |       2.12       0.11    19.62    0.00                     0.10
         age |      -0.01       0.00   -14.58    0.00                    -0.38
        age2 |       0.00       0.00    15.21    0.00                     0.40
         mar |       0.28       0.01    43.53    0.00                     0.22
        educ |       0.01       0.00    11.58    0.00                     0.06
        male |      -0.05       0.01    -8.39    0.00                    -0.04
      hompop |      -0.01       0.00    -5.29    0.00                    -0.03
       white |       0.09       0.01    11.46    0.00                     0.05
       _cons |       2.09       0.03    77.11    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' `extCon',beta robust
reg swb wrkslf realinc `socDem' `extCon',beta robust

Linear regression                               Number of obs     =     30,366
                                                F(24, 30341)      =     121.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0870
                                                Root MSE          =      .5993

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.00       0.01     0.34    0.74                     0.00
     realinc |       1.97       0.13    15.28    0.00                     0.10
         age |      -0.02       0.00   -12.71    0.00                    -0.42
        age2 |       0.00       0.00    12.74    0.00                     0.42
         mar |       0.29       0.01    34.92    0.00                     0.23
        educ |       0.01       0.00     6.99    0.00                     0.05
        male |      -0.02       0.01    -2.97    0.00                    -0.02
      hompop |      -0.01       0.00    -2.85    0.00                    -0.02
       white |       0.06       0.01     6.35    0.00                     0.04
             |
       isco1 |
administr~l  |       0.00       0.01     0.08    0.93                     0.00
   clerical  |       0.00       0.01     0.19    0.85                     0.00
      sales  |      -0.02       0.01    -1.77    0.08                    -0.01
    service  |      -0.01       0.01    -0.93    0.35                    -0.01
 agriculure  |      -0.01       0.04    -0.33    0.74                    -0.00
productio~t  |      -0.03       0.02    -1.96    0.05                    -0.01
craft, te..  |      -0.05       0.01    -3.95    0.00                    -0.03
             |
      region |
middle at..  |      -0.01       0.02    -0.83    0.41                    -0.01
e. nor. c..  |       0.01       0.02     0.33    0.74                     0.00
w. nor. c..  |       0.05       0.02     2.75    0.01                     0.02
south atl..  |       0.03       0.02     1.65    0.10                     0.02
e. sou. c..  |       0.09       0.02     4.44    0.00                     0.04
w. sou. c..  |       0.05       0.02     2.85    0.00                     0.03
   mountain  |       0.03       0.02     1.73    0.08                     0.01
    pacific  |       0.00       0.02     0.05    0.96                     0.00
             |
       _cons |       2.16       0.04    51.98    0.00                        .
------------------------------------------------------------------------------

. 

. reg swb wrkslf realinc `socDem' hrs1 ,beta robust 
reg swb wrkslf realinc `socDem' hrs1 ,beta robust 

Linear regression                               Number of obs     =     30,636
                                                F(10, 30625)      =     218.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0668
                                                Root MSE          =     .58706

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.01     1.30    0.19                     0.01
     realinc |       1.82       0.13    14.06    0.00                     0.09
         age |      -0.02       0.00    -9.75    0.00                    -0.34
        age2 |       0.00       0.00     9.48    0.00                     0.34
         mar |       0.25       0.01    31.33    0.00                     0.20
        educ |       0.01       0.00     7.97    0.00                     0.05
        male |      -0.04       0.01    -5.95    0.00                    -0.03
      hompop |      -0.01       0.00    -3.68    0.00                    -0.02
       white |       0.08       0.01     8.89    0.00                     0.05
        hrs1 |       0.00       0.00     2.84    0.00                     0.02
       _cons |       2.14       0.04    56.52    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' hea ,beta robust
reg swb wrkslf realinc `socDem' hea ,beta robust

Linear regression                               Number of obs     =     36,452
                                                F(10, 36441)      =     555.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1340
                                                Root MSE          =     .59384

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.01     0.88    0.38                     0.00
     realinc |       1.56       0.13    12.37    0.00                     0.07
         age |      -0.01       0.00    -8.40    0.00                    -0.25
        age2 |       0.00       0.00    10.80    0.00                     0.32
         mar |       0.27       0.01    36.91    0.00                     0.21
        educ |       0.00       0.00     2.65    0.01                     0.02
        male |      -0.05       0.01    -7.54    0.00                    -0.04
      hompop |      -0.01       0.00    -4.08    0.00                    -0.02
       white |       0.08       0.01     9.07    0.00                     0.05
      health |       0.18       0.00    43.91    0.00                     0.24
       _cons |       1.52       0.03    46.34    0.00                        .
------------------------------------------------------------------------------

. 

. reg swb wrkslf realinc `socDem' i.region,beta robust
reg swb wrkslf realinc `socDem' i.region,beta robust

Linear regression                               Number of obs     =     49,014
                                                F(17, 48996)      =     254.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0808
                                                Root MSE          =     .60626

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.74    0.08                     0.01
     realinc |       2.21       0.11    20.38    0.00                     0.10
         age |      -0.01       0.00   -14.59    0.00                    -0.38
        age2 |       0.00       0.00    15.25    0.00                     0.40
         mar |       0.28       0.01    43.01    0.00                     0.22
        educ |       0.01       0.00    11.86    0.00                     0.06
        male |      -0.05       0.01    -8.42    0.00                    -0.04
      hompop |      -0.01       0.00    -4.94    0.00                    -0.03
       white |       0.09       0.01    11.71    0.00                     0.05
             |
      region |
middle at..  |      -0.04       0.01    -2.66    0.01                    -0.02
e. nor. c..  |      -0.00       0.01    -0.15    0.88                    -0.00
w. nor. c..  |       0.04       0.02     2.75    0.01                     0.02
south atl..  |       0.03       0.01     2.20    0.03                     0.02
e. sou. c..  |       0.06       0.02     3.99    0.00                     0.03
w. sou. c..  |       0.04       0.01     2.46    0.01                     0.02
   mountain  |       0.02       0.02     1.06    0.29                     0.01
    pacific  |      -0.01       0.01    -0.54    0.59                    -0.00
             |
       _cons |       2.07       0.03    69.48    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.isco1,beta robust
reg swb wrkslf realinc `socDem' i.isco1,beta robust

Linear regression                               Number of obs     =     30,366
                                                F(16, 30349)      =     177.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0850
                                                Root MSE          =     .59987

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.00       0.01     0.40    0.69                     0.00
     realinc |       1.88       0.13    14.64    0.00                     0.09
         age |      -0.02       0.00   -12.67    0.00                    -0.42
        age2 |       0.00       0.00    12.66    0.00                     0.42
         mar |       0.29       0.01    35.40    0.00                     0.23
        educ |       0.01       0.00     6.68    0.00                     0.05
        male |      -0.02       0.01    -3.01    0.00                    -0.02
      hompop |      -0.01       0.00    -3.12    0.00                    -0.02
       white |       0.06       0.01     6.30    0.00                     0.04
             |
       isco1 |
administr~l  |      -0.00       0.01    -0.08    0.94                    -0.00
   clerical  |       0.00       0.01     0.07    0.95                     0.00
      sales  |      -0.03       0.01    -2.00    0.05                    -0.01
    service  |      -0.01       0.01    -1.08    0.28                    -0.01
 agriculure  |      -0.00       0.04    -0.11    0.92                    -0.00
productio~t  |      -0.03       0.02    -2.04    0.04                    -0.01
craft, te..  |      -0.05       0.01    -4.04    0.00                    -0.03
             |
       _cons |       2.19       0.04    56.98    0.00                        .
------------------------------------------------------------------------------

. ta isco1 if e(sample)==1
ta isco1 if e(sample)==1

       1 digit occupation |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
             professional |      4,087       13.46       13.46
administrative/managerial |      5,349       17.62       31.07
                 clerical |      3,776       12.43       43.51
                    sales |      4,257       14.02       57.53
                  service |      4,061       13.37       70.90
               agriculure |        320        1.05       71.96
     production,transport |      3,094       10.19       82.14
         craft, technical |      5,422       17.86      100.00
--------------------------+-----------------------------------
                    Total |     30,366      100.00

. reg swb wrkslf realinc `socDem' i.isco1 if isco1==1 | isco1==7,beta robust
reg swb wrkslf realinc `socDem' i.isco1 if isco1==1 | isco1==7,beta robust

Linear regression                               Number of obs     =      7,181
                                                F(10, 7170)       =      69.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0871
                                                Root MSE          =     .59183

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |      -0.01       0.02    -0.34    0.73                    -0.00
     realinc |       1.94       0.24     8.00    0.00                     0.10
         age |      -0.01       0.00    -4.68    0.00                    -0.33
        age2 |       0.00       0.00     4.76    0.00                     0.34
         mar |       0.28       0.02    16.64    0.00                     0.23
        educ |       0.01       0.00     4.28    0.00                     0.06
        male |      -0.01       0.02    -0.62    0.54                    -0.01
      hompop |       0.00       0.01     0.49    0.62                     0.01
       white |       0.04       0.02     1.75    0.08                     0.02
             |
       isco1 |
productio~t  |      -0.03       0.02    -1.63    0.10                    -0.02
       _cons |       2.07       0.08    26.06    0.00                        .
------------------------------------------------------------------------------

. 

. bys isco1: reg swb wrkslf realinc `socDem' i.region,beta robust
bys isco1: reg swb wrkslf realinc `socDem' i.region,beta robust

------------------------------------------------------------------------------
-> isco1 = professional

Linear regression                               Number of obs     =      4,087
                                                F(17, 4069)       =      23.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0888
                                                Root MSE          =     .57579

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |      -0.01       0.02    -0.53    0.60                    -0.01
     realinc |       1.73       0.28     6.12    0.00                     0.11
         age |      -0.01       0.00    -3.07    0.00                    -0.29
        age2 |       0.00       0.00     3.21    0.00                     0.30
         mar |       0.26       0.02    11.57    0.00                     0.21
        educ |       0.02       0.00     5.29    0.00                     0.09
        male |      -0.02       0.02    -1.05    0.29                    -0.02
      hompop |      -0.01       0.01    -0.70    0.49                    -0.01
       white |       0.06       0.03     2.35    0.02                     0.04
             |
      region |
middle at..  |      -0.02       0.05    -0.48    0.63                    -0.01
e. nor. c..  |      -0.02       0.05    -0.41    0.68                    -0.01
w. nor. c..  |       0.02       0.05     0.43    0.67                     0.01
south atl..  |      -0.01       0.05    -0.30    0.76                    -0.01
e. sou. c..  |       0.18       0.06     3.15    0.00                     0.07
w. sou. c..  |       0.04       0.05     0.82    0.41                     0.02
   mountain  |      -0.01       0.05    -0.19    0.85                    -0.00
    pacific  |      -0.02       0.05    -0.38    0.70                    -0.01
             |
       _cons |       1.96       0.11    17.26    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = administrative/managerial

Linear regression                               Number of obs     =      5,349
                                                F(17, 5331)       =      23.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0727
                                                Root MSE          =     .58471

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.03     0.25    0.81                     0.00
     realinc |       1.23       0.25     4.86    0.00                     0.07
         age |      -0.02       0.00    -6.82    0.00                    -0.56
        age2 |       0.00       0.00     6.81    0.00                     0.57
         mar |       0.26       0.02    13.03    0.00                     0.21
        educ |       0.01       0.00     2.15    0.03                     0.03
        male |      -0.04       0.02    -2.24    0.03                    -0.03
      hompop |       0.00       0.01     0.66    0.51                     0.01
       white |       0.10       0.02     4.41    0.00                     0.06
             |
      region |
middle at..  |      -0.03       0.04    -0.89    0.37                    -0.02
e. nor. c..  |      -0.00       0.04    -0.12    0.90                    -0.00
w. nor. c..  |       0.06       0.04     1.45    0.15                     0.03
south atl..  |       0.02       0.04     0.50    0.62                     0.01
e. sou. c..  |       0.08       0.05     1.68    0.09                     0.03
w. sou. c..  |       0.02       0.04     0.48    0.63                     0.01
   mountain  |       0.04       0.04     0.88    0.38                     0.02
    pacific  |      -0.01       0.04    -0.34    0.74                    -0.01
             |
       _cons |       2.36       0.10    23.88    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = clerical

Linear regression                               Number of obs     =      3,776
                                                F(17, 3758)       =      21.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0859
                                                Root MSE          =     .59262

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.00       0.03     0.06    0.96                     0.00
     realinc |       2.33       0.33     7.15    0.00                     0.13
         age |      -0.02       0.00    -5.46    0.00                    -0.50
        age2 |       0.00       0.00     5.20    0.00                     0.48
         mar |       0.26       0.02    10.95    0.00                     0.21
        educ |       0.01       0.00     1.41    0.16                     0.02
        male |      -0.00       0.02    -0.00    1.00                    -0.00
      hompop |      -0.02       0.01    -2.10    0.04                    -0.04
       white |       0.14       0.03     5.11    0.00                     0.09
             |
      region |
middle at..  |       0.01       0.05     0.26    0.79                     0.01
e. nor. c..  |       0.04       0.05     0.88    0.38                     0.03
w. nor. c..  |       0.01       0.05     0.14    0.88                     0.00
south atl..  |       0.02       0.05     0.48    0.63                     0.01
e. sou. c..  |       0.06       0.06     0.95    0.34                     0.02
w. sou. c..  |       0.09       0.05     1.70    0.09                     0.04
   mountain  |       0.08       0.05     1.54    0.12                     0.04
    pacific  |       0.00       0.05     0.03    0.97                     0.00
             |
       _cons |       2.27       0.12    19.71    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = sales

Linear regression                               Number of obs     =      4,257
                                                F(17, 4239)       =      23.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0878
                                                Root MSE          =     .60018

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.06       0.06     0.90    0.37                     0.01
     realinc |       2.63       0.40     6.51    0.00                     0.11
         age |      -0.01       0.00    -4.16    0.00                    -0.37
        age2 |       0.00       0.00     4.10    0.00                     0.37
         mar |       0.29       0.02    13.74    0.00                     0.23
        educ |       0.01       0.00     2.70    0.01                     0.04
        male |      -0.03       0.02    -1.02    0.31                    -0.02
      hompop |      -0.01       0.01    -1.04    0.30                    -0.02
       white |       0.06       0.02     2.39    0.02                     0.04
             |
      region |
middle at..  |      -0.05       0.05    -0.93    0.35                    -0.03
e. nor. c..  |      -0.00       0.05    -0.08    0.94                    -0.00
w. nor. c..  |       0.03       0.05     0.54    0.59                     0.01
south atl..  |      -0.01       0.05    -0.16    0.88                    -0.00
e. sou. c..  |       0.07       0.06     1.28    0.20                     0.03
w. sou. c..  |       0.01       0.05     0.16    0.87                     0.00
   mountain  |       0.01       0.05     0.24    0.81                     0.01
    pacific  |      -0.03       0.05    -0.59    0.56                    -0.02
             |
       _cons |       2.05       0.11    18.89    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = service

Linear regression                               Number of obs     =      4,061
                                                F(17, 4043)       =      19.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0755
                                                Root MSE          =     .61283

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.03     0.54    0.59                     0.01
     realinc |       2.29       0.42     5.39    0.00                     0.09
         age |      -0.02       0.00    -4.73    0.00                    -0.41
        age2 |       0.00       0.00     4.65    0.00                     0.41
         mar |       0.30       0.02    12.77    0.00                     0.23
        educ |       0.02       0.00     3.75    0.00                     0.07
        male |      -0.03       0.02    -1.40    0.16                    -0.02
      hompop |      -0.02       0.01    -2.01    0.04                    -0.04
       white |       0.02       0.02     0.94    0.35                     0.02
             |
      region |
middle at..  |      -0.02       0.05    -0.42    0.68                    -0.01
e. nor. c..  |      -0.03       0.05    -0.54    0.59                    -0.02
w. nor. c..  |       0.06       0.06     1.06    0.29                     0.03
south atl..  |      -0.02       0.05    -0.38    0.70                    -0.01
e. sou. c..  |      -0.00       0.06    -0.06    0.95                    -0.00
w. sou. c..  |       0.06       0.05     1.11    0.27                     0.03
   mountain  |       0.01       0.06     0.16    0.88                     0.00
    pacific  |      -0.00       0.05    -0.05    0.96                    -0.00
             |
       _cons |       2.11       0.11    19.74    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = agriculure

Linear regression                               Number of obs     =        320
                                                F(17, 302)        =       3.04
                                                Prob > F          =     0.0001
                                                R-squared         =     0.1042
                                                Root MSE          =     .59157

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.00       0.09     0.02    0.98                     0.00
     realinc |       4.60       1.16     3.98    0.00                     0.21
         age |      -0.01       0.01    -1.39    0.16                    -0.44
        age2 |       0.00       0.00     1.76    0.08                     0.55
         mar |       0.16       0.08     1.97    0.05                     0.13
        educ |       0.00       0.01     0.36    0.72                     0.03
        male |       0.10       0.10     1.00    0.32                     0.06
      hompop |      -0.03       0.03    -1.05    0.29                    -0.07
       white |      -0.04       0.12    -0.31    0.75                    -0.02
             |
      region |
middle at..  |      -0.28       0.17    -1.68    0.09                    -0.10
e. nor. c..  |      -0.05       0.15    -0.32    0.75                    -0.03
w. nor. c..  |      -0.13       0.15    -0.92    0.36                    -0.08
south atl..  |      -0.06       0.15    -0.38    0.70                    -0.03
e. sou. c..  |       0.10       0.15     0.67    0.50                     0.05
w. sou. c..  |      -0.11       0.15    -0.74    0.46                    -0.06
   mountain  |      -0.11       0.17    -0.63    0.53                    -0.05
    pacific  |      -0.00       0.16    -0.02    0.99                    -0.00
             |
       _cons |       2.22       0.36     6.15    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = production,transport

Linear regression                               Number of obs     =      3,094
                                                F(17, 3076)       =      18.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0902
                                                Root MSE          =     .60818

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.03     0.31    0.76                     0.01
     realinc |       3.03       0.52     5.79    0.00                     0.10
         age |      -0.02       0.00    -3.68    0.00                    -0.39
        age2 |       0.00       0.00     3.67    0.00                     0.40
         mar |       0.30       0.03    11.67    0.00                     0.24
        educ |       0.01       0.01     1.10    0.27                     0.02
        male |       0.02       0.03     0.65    0.52                     0.01
      hompop |       0.01       0.01     1.53    0.13                     0.03
       white |       0.01       0.03     0.26    0.79                     0.00
             |
      region |
middle at..  |      -0.01       0.06    -0.14    0.89                    -0.00
e. nor. c..  |       0.03       0.05     0.46    0.64                     0.02
w. nor. c..  |       0.08       0.06     1.36    0.17                     0.03
south atl..  |       0.04       0.05     0.80    0.42                     0.03
e. sou. c..  |       0.17       0.06     2.79    0.01                     0.07
w. sou. c..  |       0.07       0.06     1.12    0.26                     0.03
   mountain  |       0.07       0.07     1.06    0.29                     0.03
    pacific  |      -0.00       0.06    -0.07    0.94                    -0.00
             |
       _cons |       2.06       0.13    15.77    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = craft, technical

Linear regression                               Number of obs     =      5,422
                                                F(17, 5404)       =      27.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0797
                                                Root MSE          =     .61637

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |      -0.01       0.03    -0.26    0.80                    -0.00
     realinc |       2.61       0.48     5.40    0.00                     0.08
         age |      -0.02       0.00    -5.57    0.00                    -0.43
        age2 |       0.00       0.00     5.81    0.00                     0.45
         mar |       0.33       0.02    16.33    0.00                     0.25
        educ |       0.01       0.00     2.53    0.01                     0.04
        male |      -0.04       0.02    -2.01    0.04                    -0.03
      hompop |      -0.02       0.01    -2.63    0.01                    -0.04
       white |       0.03       0.02     1.42    0.16                     0.02
             |
      region |
middle at..  |       0.04       0.04     0.91    0.36                     0.02
e. nor. c..  |       0.05       0.04     1.29    0.20                     0.03
w. nor. c..  |       0.13       0.05     2.66    0.01                     0.05
south atl..  |       0.15       0.04     3.45    0.00                     0.09
e. sou. c..  |       0.12       0.05     2.49    0.01                     0.05
w. sou. c..  |       0.11       0.05     2.37    0.02                     0.05
   mountain  |       0.05       0.05     1.03    0.30                     0.02
    pacific  |       0.08       0.05     1.86    0.06                     0.04
             |
       _cons |       2.08       0.09    22.71    0.00                        .
------------------------------------------------------------------------------

------------------------------------------------------------------------------
-> isco1 = .

Linear regression                               Number of obs     =     18,648
                                                F(17, 18630)      =      92.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0792
                                                Root MSE          =     .61493

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.03       0.01     2.04    0.04                     0.01
     realinc |       2.65       0.21    12.65    0.00                     0.10
         age |      -0.01       0.00    -8.67    0.00                    -0.38
        age2 |       0.00       0.00     9.81    0.00                     0.44
         mar |       0.27       0.01    24.68    0.00                     0.20
        educ |       0.01       0.00     7.45    0.00                     0.06
        male |      -0.08       0.01    -8.47    0.00                    -0.06
      hompop |      -0.01       0.00    -3.56    0.00                    -0.03
       white |       0.15       0.01    11.20    0.00                     0.09
             |
      region |
middle at..  |      -0.07       0.02    -3.24    0.00                    -0.04
e. nor. c..  |      -0.01       0.02    -0.68    0.49                    -0.01
w. nor. c..  |       0.02       0.02     0.66    0.51                     0.01
south atl..  |       0.04       0.02     1.73    0.08                     0.02
e. sou. c..  |       0.03       0.03     1.12    0.26                     0.01
w. sou. c..  |       0.01       0.03     0.23    0.81                     0.00
   mountain  |      -0.02       0.03    -0.81    0.42                    -0.01
    pacific  |      -0.03       0.02    -1.22    0.22                    -0.01
             |
       _cons |       2.01       0.05    41.45    0.00                        .
------------------------------------------------------------------------------

. 

. codebook isco1
codebook isco1

------------------------------------------------------------------------------
isco1                                                       1 digit occupation
------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  isco1_lbl

                 range:  [1,8]                        units:  1
         unique values:  8                        missing .:  23,978/62,465

            tabulation:  Freq.   Numeric  Label
                         5,136         1  professional
                         6,720         2  administrative/managerial
                         4,734         3  clerical
                         5,448         4  sales
                         5,231         5  service
                           392         6  agriculure
                         3,860         7  production,transport
                         6,966         8  craft, technical
                        23,978         .  

. recode isco1 (.=0), gen(is)
recode isco1 (.=0), gen(is)
variable is already defined
r(110);

. ta isco1 is, mi
ta isco1 is, mi

                      |     RECODE of isco1 (1 digit
                      |           occupation)
   1 digit occupation |         0          1          2 |     Total
----------------------+---------------------------------+----------
         professional |         0      5,136          0 |     5,136 
administrative/manage |         0          0      6,720 |     6,720 
             clerical |         0          0          0 |     4,734 
                sales |         0          0          0 |     5,448 
              service |         0          0          0 |     5,231 
           agriculure |         0          0          0 |       392 
 production,transport |         0          0          0 |     3,860 
     craft, technical |         0          0          0 |     6,966 
                    . |    23,978          0          0 |    23,978 
----------------------+---------------------------------+----------
                Total |    23,978      5,136      6,720 |    62,465 


                      |     RECODE of isco1 (1 digit
                      |           occupation)
   1 digit occupation |         3          4          5 |     Total
----------------------+---------------------------------+----------
         professional |         0          0          0 |     5,136 
administrative/manage |         0          0          0 |     6,720 
             clerical |     4,734          0          0 |     4,734 
                sales |         0      5,448          0 |     5,448 
              service |         0          0      5,231 |     5,231 
           agriculure |         0          0          0 |       392 
 production,transport |         0          0          0 |     3,860 
     craft, technical |         0          0          0 |     6,966 
                    . |         0          0          0 |    23,978 
----------------------+---------------------------------+----------
                Total |     4,734      5,448      5,231 |    62,465 


                      |     RECODE of isco1 (1 digit
                      |           occupation)
   1 digit occupation |         6          7          8 |     Total
----------------------+---------------------------------+----------
         professional |         0          0          0 |     5,136 
administrative/manage |         0          0          0 |     6,720 
             clerical |         0          0          0 |     4,734 
                sales |         0          0          0 |     5,448 
              service |         0          0          0 |     5,231 
           agriculure |       392          0          0 |       392 
 production,transport |         0      3,860          0 |     3,860 
     craft, technical |         0          0      6,966 |     6,966 
                    . |         0          0          0 |    23,978 
----------------------+---------------------------------+----------
                Total |       392      3,860      6,966 |    62,465 


. 

. reg swb wrkslf realinc `socDem' i.is,beta robust
reg swb wrkslf realinc `socDem' i.is,beta robust
reg swb wrkslf realinc `socDem' i.is i.year,beta robust 

Linear regression                               Number of obs     =     49,014
                                                F(17, 48996)      =     248.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0792
                                                Root MSE          =      .6068

reg swb wrkslf realinc `socDem' i.is i.year hrs1,beta robust
------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.74    0.08                     0.01
     realinc |       2.08       0.11    19.00    0.00                     0.10
         age |      -0.01       0.00   -14.50    0.00                    -0.38
        age2 |       0.00       0.00    15.13    0.00                     0.40
         mar |       0.28       0.01    43.19    0.00                     0.22
        educ |       0.01       0.00     9.65    0.00                     0.05
        male |      -0.05       0.01    -7.72    0.00                    -0.04
      hompop |      -0.01       0.00    -5.23    0.00                    -0.03
       white |       0.09       0.01    11.28    0.00                     0.05
             |
          is |
          1  |       0.01       0.01     1.28    0.20                     0.01
          2  |       0.01       0.01     0.91    0.36                     0.00
          3  |       0.02       0.01     1.48    0.14                     0.01
          4  |      -0.01       0.01    -1.33    0.18                    -0.01
          5  |       0.00       0.01     0.46    0.65                     0.00
          6  |       0.01       0.03     0.41    0.68                     0.00
          7  |      -0.00       0.01    -0.28    0.78                    -0.00
          8  |      -0.03       0.01    -2.90    0.00                    -0.01
             |
       _cons |       2.11       0.03    75.65    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year,beta robust 
reg swb wrkslf realinc `socDem' i.is i.year hea,beta robust

Linear regression                               Number of obs     =     49,014
                                                F(47, 48966)      =      92.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0815
                                                Root MSE          =     .60621

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.68    0.09                     0.01
     realinc |       2.07       0.11    18.91    0.00                     0.09
         age |      -0.01       0.00   -14.16    0.00                    -0.37
        age2 |       0.00       0.00    14.92    0.00                     0.40
         mar |       0.28       0.01    42.76    0.00                     0.22
        educ |       0.01       0.00    10.05    0.00                     0.06
        male |      -0.04       0.01    -7.50    0.00                    -0.03
      hompop |      -0.01       0.00    -5.07    0.00                    -0.03
       white |       0.08       0.01    10.60    0.00                     0.05
             |
          is |
          1  |       0.01       0.05     0.28    0.78                     0.01
          2  |       0.01       0.05     0.17    0.87                     0.00
          3  |       0.02       0.05     0.37    0.71                     0.01
          4  |      -0.02       0.05    -0.39    0.70                    -0.01
          5  |       0.00       0.05     0.08    0.94                     0.00
          6  |       0.01       0.06     0.19    0.85                     0.00
          7  |      -0.01       0.05    -0.15    0.88                    -0.00
          8  |      -0.03       0.05    -0.71    0.48                    -0.02
             |
        year |
       1973  |       0.08       0.03     3.33    0.00                     0.02
       1974  |       0.09       0.03     3.43    0.00                     0.02
       1975  |       0.06       0.02     2.30    0.02                     0.01
       1976  |       0.08       0.02     3.06    0.00                     0.02
       1977  |       0.10       0.02     3.90    0.00                     0.02
       1978  |       0.11       0.02     4.38    0.00                     0.03
       1980  |       0.06       0.03     2.53    0.01                     0.02
       1982  |       0.06       0.02     2.68    0.01                     0.02
       1983  |       0.05       0.02     2.06    0.04                     0.01
       1984  |       0.10       0.03     3.84    0.00                     0.02
       1985  |       0.03       0.02     1.39    0.16                     0.01
       1986  |       0.08       0.02     3.27    0.00                     0.02
       1987  |       0.06       0.02     2.63    0.01                     0.02
       1988  |       0.14       0.05     2.65    0.01                     0.03
       1989  |       0.10       0.05     1.92    0.05                     0.02
       1990  |       0.13       0.05     2.56    0.01                     0.03
       1991  |       0.09       0.05     1.75    0.08                     0.02
       1993  |       0.07       0.05     1.35    0.18                     0.02
       1994  |       0.05       0.05     1.00    0.32                     0.02
       1996  |       0.07       0.05     1.49    0.14                     0.03
       1998  |       0.09       0.05     1.82    0.07                     0.03
       2000  |       0.11       0.05     2.16    0.03                     0.04
       2002  |       0.07       0.05     1.38    0.17                     0.02
       2004  |       0.05       0.05     1.04    0.30                     0.01
       2006  |       0.07       0.05     1.38    0.17                     0.02
       2008  |       0.02       0.05     0.43    0.67                     0.01
       2010  |       0.01       0.05     0.13    0.90                     0.00
       2012  |       0.06       0.05     1.14    0.25                     0.02
       2014  |       0.06       0.05     1.24    0.21                     0.02
       2016  |       0.03       0.05     0.56    0.58                     0.01
             |
       _cons |       2.03       0.03    61.90    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year hrs1,beta robust

Linear regression                               Number of obs     =     30,636
                                                F(47, 30588)      =      48.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0694
                                                Root MSE          =     .58658

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.01     1.22    0.22                     0.01
     realinc |       1.75       0.13    13.39    0.00                     0.09
         age |      -0.02       0.00    -9.82    0.00                    -0.35
        age2 |       0.00       0.00     9.59    0.00                     0.34
         mar |       0.25       0.01    31.10    0.00                     0.20
        educ |       0.01       0.00     6.48    0.00                     0.04
        male |      -0.04       0.01    -5.50    0.00                    -0.03
      hompop |      -0.01       0.00    -3.51    0.00                    -0.02
       white |       0.08       0.01     8.50    0.00                     0.05
             |
          is |
          1  |       0.01       0.06     0.18    0.85                     0.01
          2  |       0.01       0.06     0.14    0.89                     0.00
          3  |       0.01       0.06     0.12    0.90                     0.00
          4  |      -0.03       0.06    -0.41    0.68                    -0.01
          5  |       0.00       0.06     0.08    0.94                     0.00
          6  |      -0.04       0.07    -0.59    0.56                    -0.01
          7  |       0.01       0.06     0.09    0.93                     0.00
          8  |      -0.04       0.06    -0.57    0.57                    -0.02
             |
        year |
       1974  |       0.02       0.03     0.62    0.54                     0.00
       1975  |      -0.02       0.03    -0.53    0.60                    -0.00
       1976  |       0.04       0.03     1.31    0.19                     0.01
       1977  |       0.04       0.03     1.33    0.18                     0.01
       1978  |       0.04       0.03     1.31    0.19                     0.01
       1980  |       0.01       0.03     0.32    0.75                     0.00
       1982  |       0.01       0.03     0.40    0.69                     0.00
       1983  |      -0.02       0.03    -0.50    0.61                    -0.00
       1984  |       0.03       0.03     1.12    0.26                     0.01
       1985  |      -0.03       0.03    -1.02    0.31                    -0.01
       1986  |       0.01       0.03     0.19    0.85                     0.00
       1987  |       0.00       0.03     0.15    0.88                     0.00
       1988  |       0.08       0.07     1.15    0.25                     0.02
       1989  |       0.05       0.07     0.68    0.50                     0.01
       1990  |       0.07       0.07     1.02    0.31                     0.02
       1991  |       0.04       0.07     0.54    0.59                     0.01
       1993  |       0.03       0.07     0.46    0.64                     0.01
       1994  |       0.01       0.07     0.08    0.93                     0.00
       1996  |       0.00       0.07     0.06    0.95                     0.00
       1998  |       0.04       0.07     0.54    0.59                     0.01
       2000  |       0.07       0.07     1.02    0.31                     0.02
       2002  |       0.03       0.07     0.46    0.65                     0.01
       2004  |       0.01       0.07     0.09    0.93                     0.00
       2006  |       0.01       0.07     0.20    0.85                     0.00
       2008  |      -0.03       0.07    -0.43    0.67                    -0.01
       2010  |      -0.04       0.07    -0.55    0.58                    -0.01
       2012  |       0.04       0.07     0.64    0.52                     0.01
       2014  |       0.05       0.07     0.69    0.49                     0.02
       2016  |       0.02       0.07     0.29    0.77                     0.01
             |
        hrs1 |       0.00       0.00     2.69    0.01                     0.02
       _cons |       2.15       0.04    48.30    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year hea,beta robust


Linear regression                               Number of obs     =     36,452
                                                F(45, 36406)      =     126.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1363
                                                Root MSE          =     .59334

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.01     0.61    0.54                     0.00
     realinc |       1.49       0.13    11.70    0.00                     0.07
         age |      -0.01       0.00    -8.34    0.00                    -0.25
        age2 |       0.00       0.00    10.74    0.00                     0.32
         mar |       0.27       0.01    36.80    0.00                     0.21
        educ |       0.00       0.00     1.65    0.10                     0.01
        male |      -0.05       0.01    -7.28    0.00                    -0.04
      hompop |      -0.01       0.00    -3.69    0.00                    -0.02
       white |       0.08       0.01     8.95    0.00                     0.05
             |
          is |
          1  |      -0.00       0.06    -0.05    0.96                    -0.00
          2  |      -0.00       0.06    -0.01    1.00                    -0.00
          3  |      -0.01       0.06    -0.24    0.81                    -0.01
          4  |      -0.04       0.06    -0.74    0.46                    -0.02
          5  |      -0.02       0.06    -0.26    0.79                    -0.01
          6  |       0.01       0.07     0.20    0.84                     0.00
          7  |      -0.02       0.06    -0.26    0.79                    -0.01
          8  |      -0.03       0.06    -0.49    0.62                    -0.01
             |
        year |
       1973  |       0.10       0.02     3.94    0.00                     0.03
       1974  |       0.09       0.02     3.82    0.00                     0.03
       1975  |       0.06       0.02     2.63    0.01                     0.02
       1976  |       0.08       0.02     3.45    0.00                     0.02
       1977  |       0.10       0.02     4.26    0.00                     0.03
       1980  |       0.08       0.02     3.10    0.00                     0.02
       1982  |       0.07       0.02     3.22    0.00                     0.02
       1984  |       0.10       0.02     4.07    0.00                     0.03
       1985  |       0.04       0.02     1.75    0.08                     0.01
       1987  |       0.07       0.02     2.89    0.00                     0.02
       1988  |       0.16       0.06     2.56    0.01                     0.04
       1989  |       0.10       0.06     1.60    0.11                     0.02
       1990  |       0.13       0.06     2.05    0.04                     0.03
       1991  |       0.11       0.06     1.79    0.07                     0.03
       1993  |       0.09       0.06     1.42    0.16                     0.02
       1994  |       0.06       0.06     0.97    0.33                     0.02
       1996  |       0.10       0.06     1.65    0.10                     0.04
       1998  |       0.11       0.06     1.88    0.06                     0.04
       2000  |       0.13       0.06     2.20    0.03                     0.05
       2002  |       0.12       0.06     1.85    0.06                     0.03
       2004  |       0.11       0.06     1.70    0.09                     0.02
       2006  |       0.11       0.06     1.87    0.06                     0.04
       2008  |       0.06       0.06     0.95    0.34                     0.02
       2010  |       0.04       0.06     0.60    0.55                     0.01
       2012  |       0.11       0.06     1.83    0.07                     0.03
       2014  |       0.11       0.06     1.87    0.06                     0.04
       2016  |       0.09       0.06     1.41    0.16                     0.03
             |
      health |       0.18       0.00    43.77    0.00                     0.24
       _cons |       1.45       0.04    38.63    0.00                        .
------------------------------------------------------------------------------

. 
. reg swb wrkslf realinc `socDem' i.is i.year if hrs1>40,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1>40,beta robust

Linear regression                               Number of obs     =     29,910
                                                F(47, 29862)      =      60.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0875
                                                Root MSE          =     .61497

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.45    0.15                     0.01
     realinc |       2.07       0.14    14.88    0.00                     0.10
         age |      -0.02       0.00   -11.96    0.00                    -0.42
        age2 |       0.00       0.00    13.03    0.00                     0.46
         mar |       0.29       0.01    34.08    0.00                     0.23
        educ |       0.01       0.00     8.62    0.00                     0.06
        male |      -0.04       0.01    -4.99    0.00                    -0.03
      hompop |      -0.01       0.00    -3.60    0.00                    -0.03
       white |       0.09       0.01     8.46    0.00                     0.05
             |
          is |
          1  |      -0.00       0.05    -0.08    0.94                    -0.00
          2  |      -0.01       0.05    -0.19    0.85                    -0.00
          3  |       0.01       0.05     0.25    0.80                     0.01
          4  |      -0.04       0.05    -0.70    0.48                    -0.02
          5  |      -0.02       0.05    -0.38    0.71                    -0.01
          6  |       0.02       0.07     0.33    0.74                     0.00
          7  |      -0.02       0.05    -0.40    0.69                    -0.01
          8  |      -0.05       0.05    -1.02    0.31                    -0.03
             |
        year |
       1973  |       0.10       0.03     3.42    0.00                     0.02
       1974  |       0.08       0.03     2.76    0.01                     0.02
       1975  |       0.06       0.03     2.00    0.05                     0.01
       1976  |       0.05       0.03     1.87    0.06                     0.01
       1977  |       0.09       0.03     3.01    0.00                     0.02
       1978  |       0.11       0.03     3.75    0.00                     0.03
       1980  |       0.06       0.03     2.19    0.03                     0.02
       1982  |       0.05       0.03     1.96    0.05                     0.01
       1983  |       0.05       0.03     1.65    0.10                     0.01
       1984  |       0.11       0.03     3.60    0.00                     0.03
       1985  |       0.03       0.03     1.07    0.28                     0.01
       1986  |       0.10       0.03     3.63    0.00                     0.03
       1987  |       0.06       0.03     2.23    0.03                     0.02
       1988  |       0.15       0.06     2.45    0.01                     0.04
       1989  |       0.09       0.06     1.57    0.12                     0.02
       1990  |       0.15       0.06     2.43    0.01                     0.03
       1991  |       0.10       0.06     1.60    0.11                     0.02
       1993  |       0.07       0.06     1.24    0.22                     0.02
       1994  |       0.06       0.06     1.11    0.27                     0.02
       1996  |       0.09       0.06     1.53    0.13                     0.03
       1998  |       0.09       0.06     1.50    0.13                     0.03
       2000  |       0.11       0.06     1.95    0.05                     0.04
       2002  |       0.09       0.06     1.53    0.13                     0.02
       2004  |       0.07       0.06     1.18    0.24                     0.02
       2006  |       0.09       0.06     1.57    0.12                     0.03
       2008  |       0.05       0.06     0.83    0.41                     0.01
       2010  |       0.02       0.06     0.30    0.77                     0.00
       2012  |       0.05       0.06     0.94    0.35                     0.02
       2014  |       0.05       0.06     0.78    0.43                     0.01
       2016  |       0.02       0.06     0.28    0.78                     0.01
             |
       _cons |       2.02       0.04    50.14    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1>60,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1>60,beta robust

Linear regression                               Number of obs     =     20,318
                                                F(47, 20270)      =      50.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1021
                                                Root MSE          =      .6315

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.17    0.24                     0.01
     realinc |       2.40       0.18    13.12    0.00                     0.10
         age |      -0.02       0.00   -10.11    0.00                    -0.43
        age2 |       0.00       0.00    11.81    0.00                     0.51
         mar |       0.32       0.01    30.28    0.00                     0.24
        educ |       0.01       0.00     7.24    0.00                     0.06
        male |      -0.06       0.01    -5.93    0.00                    -0.04
      hompop |      -0.01       0.00    -2.66    0.01                    -0.02
       white |       0.09       0.01     6.73    0.00                     0.05
             |
          is |
          1  |       0.00       0.06     0.01    0.99                     0.00
          2  |      -0.00       0.06    -0.03    0.97                    -0.00
          3  |       0.02       0.06     0.33    0.74                     0.01
          4  |      -0.02       0.06    -0.24    0.81                    -0.01
          5  |      -0.00       0.06    -0.04    0.97                    -0.00
          6  |       0.04       0.08     0.50    0.62                     0.01
          7  |      -0.04       0.06    -0.57    0.57                    -0.01
          8  |      -0.04       0.06    -0.59    0.55                    -0.02
             |
        year |
       1973  |       0.10       0.03     3.17    0.00                     0.03
       1974  |       0.09       0.03     2.81    0.01                     0.02
       1975  |       0.06       0.03     1.90    0.06                     0.02
       1976  |       0.04       0.03     1.12    0.26                     0.01
       1977  |       0.08       0.03     2.32    0.02                     0.02
       1978  |       0.10       0.03     3.28    0.00                     0.03
       1980  |       0.04       0.03     1.29    0.20                     0.01
       1982  |       0.04       0.03     1.41    0.16                     0.01
       1983  |       0.05       0.03     1.47    0.14                     0.01
       1984  |       0.09       0.04     2.61    0.01                     0.02
       1985  |       0.04       0.03     1.38    0.17                     0.01
       1986  |       0.10       0.03     3.07    0.00                     0.02
       1987  |       0.04       0.03     1.30    0.20                     0.01
       1988  |       0.13       0.07     1.91    0.06                     0.03
       1989  |       0.07       0.07     1.05    0.29                     0.02
       1990  |       0.11       0.07     1.63    0.10                     0.02
       1991  |       0.09       0.07     1.29    0.20                     0.02
       1993  |       0.03       0.07     0.43    0.67                     0.01
       1994  |       0.02       0.07     0.32    0.75                     0.01
       1996  |       0.09       0.07     1.29    0.20                     0.03
       1998  |       0.08       0.07     1.13    0.26                     0.02
       2000  |       0.07       0.07     0.97    0.33                     0.02
       2002  |       0.04       0.07     0.63    0.53                     0.01
       2004  |       0.03       0.07     0.49    0.62                     0.01
       2006  |       0.06       0.07     0.90    0.37                     0.02
       2008  |       0.01       0.07     0.18    0.86                     0.00
       2010  |      -0.02       0.07    -0.24    0.81                    -0.00
       2012  |       0.00       0.07     0.03    0.98                     0.00
       2014  |      -0.01       0.07    -0.08    0.94                    -0.00
       2016  |      -0.04       0.07    -0.61    0.54                    -0.01
             |
       _cons |       1.98       0.05    40.35    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1<41,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1<41,beta robust

Linear regression                               Number of obs     =     19,104
                                                F(46, 19057)      =      34.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0751
                                                Root MSE          =     .59172

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.01     0.41    0.68                     0.00
     realinc |       2.03       0.18    11.41    0.00                     0.09
         age |      -0.02       0.00    -7.79    0.00                    -0.34
        age2 |       0.00       0.00     7.73    0.00                     0.34
         mar |       0.26       0.01    25.70    0.00                     0.21
        educ |       0.01       0.00     4.94    0.00                     0.04
        male |      -0.05       0.01    -5.75    0.00                    -0.04
      hompop |      -0.01       0.00    -3.35    0.00                    -0.03
       white |       0.07       0.01     6.53    0.00                     0.05
             |
          is |
          1  |       0.05       0.09     0.62    0.54                     0.02
          2  |       0.04       0.09     0.50    0.62                     0.02
          3  |       0.03       0.09     0.36    0.72                     0.01
          4  |       0.01       0.09     0.17    0.86                     0.01
          5  |       0.04       0.09     0.49    0.63                     0.02
          6  |      -0.03       0.10    -0.25    0.80                    -0.00
          7  |       0.03       0.09     0.35    0.73                     0.01
          8  |       0.01       0.09     0.14    0.89                     0.01
             |
        year |
       1974  |       0.03       0.04     0.89    0.37                     0.01
       1975  |      -0.01       0.04    -0.13    0.89                    -0.00
       1976  |       0.05       0.04     1.31    0.19                     0.01
       1977  |       0.05       0.04     1.26    0.21                     0.01
       1978  |       0.05       0.04     1.32    0.19                     0.01
       1980  |       0.00       0.04     0.07    0.94                     0.00
       1982  |       0.02       0.04     0.44    0.66                     0.00
       1983  |      -0.00       0.04    -0.13    0.90                    -0.00
       1984  |       0.02       0.04     0.56    0.58                     0.01
       1985  |      -0.02       0.04    -0.60    0.55                    -0.01
       1986  |      -0.01       0.04    -0.33    0.74                    -0.00
       1987  |       0.00       0.04     0.06    0.95                     0.00
       1988  |       0.05       0.09     0.57    0.57                     0.01
       1989  |       0.04       0.09     0.40    0.69                     0.01
       1990  |       0.04       0.09     0.46    0.64                     0.01
       1991  |       0.01       0.09     0.12    0.90                     0.00
       1993  |      -0.00       0.09    -0.03    0.98                    -0.00
       1994  |      -0.04       0.09    -0.44    0.66                    -0.01
       1996  |      -0.02       0.09    -0.17    0.86                    -0.01
       1998  |       0.03       0.09     0.30    0.77                     0.01
       2000  |       0.03       0.09     0.32    0.75                     0.01
       2002  |      -0.03       0.09    -0.31    0.75                    -0.01
       2004  |      -0.04       0.09    -0.45    0.65                    -0.01
       2006  |      -0.03       0.09    -0.38    0.71                    -0.01
       2008  |      -0.09       0.09    -0.99    0.32                    -0.03
       2010  |      -0.08       0.09    -0.86    0.39                    -0.02
       2012  |      -0.00       0.09    -0.03    0.98                    -0.00
       2014  |       0.02       0.09     0.21    0.83                     0.01
       2016  |      -0.02       0.09    -0.22    0.82                    -0.01
             |
       _cons |       2.15       0.05    39.57    0.00                        .
------------------------------------------------------------------------------

. 

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1>35,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1>35,beta robust

Linear regression                               Number of obs     =     41,917
                                                F(47, 41869)      =      80.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0824
                                                Root MSE          =     .60675

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.02       0.01     1.71    0.09                     0.01
     realinc |       2.11       0.12    17.69    0.00                     0.10
         age |      -0.01       0.00   -13.28    0.00                    -0.38
        age2 |       0.00       0.00    13.99    0.00                     0.41
         mar |       0.28       0.01    39.77    0.00                     0.22
        educ |       0.01       0.00     9.06    0.00                     0.06
        male |      -0.04       0.01    -6.25    0.00                    -0.03
      hompop |      -0.01       0.00    -4.70    0.00                    -0.03
       white |       0.08       0.01     9.89    0.00                     0.05
             |
          is |
          1  |      -0.01       0.05    -0.14    0.89                    -0.00
          2  |      -0.01       0.05    -0.14    0.89                    -0.00
          3  |       0.00       0.05     0.07    0.94                     0.00
          4  |      -0.03       0.05    -0.71    0.48                    -0.02
          5  |      -0.02       0.05    -0.36    0.72                    -0.01
          6  |       0.00       0.06     0.02    0.98                     0.00
          7  |      -0.02       0.05    -0.48    0.63                    -0.01
          8  |      -0.05       0.05    -1.14    0.25                    -0.03
             |
        year |
       1973  |       0.10       0.03     3.73    0.00                     0.02
       1974  |       0.09       0.03     3.23    0.00                     0.02
       1975  |       0.07       0.03     2.49    0.01                     0.02
       1976  |       0.07       0.03     2.80    0.01                     0.02
       1977  |       0.10       0.03     3.80    0.00                     0.02
       1978  |       0.10       0.03     3.86    0.00                     0.02
       1980  |       0.07       0.03     2.76    0.01                     0.02
       1982  |       0.07       0.02     2.81    0.00                     0.02
       1983  |       0.05       0.03     2.00    0.05                     0.01
       1984  |       0.10       0.03     3.83    0.00                     0.03
       1985  |       0.03       0.02     1.25    0.21                     0.01
       1986  |       0.08       0.03     3.20    0.00                     0.02
       1987  |       0.07       0.02     2.83    0.00                     0.02
       1988  |       0.15       0.05     2.80    0.01                     0.04
       1989  |       0.12       0.05     2.22    0.03                     0.03
       1990  |       0.15       0.05     2.86    0.00                     0.04
       1991  |       0.11       0.05     2.08    0.04                     0.03
       1993  |       0.08       0.05     1.55    0.12                     0.02
       1994  |       0.08       0.05     1.45    0.15                     0.03
       1996  |       0.09       0.05     1.74    0.08                     0.03
       1998  |       0.11       0.05     2.10    0.04                     0.04
       2000  |       0.13       0.05     2.45    0.01                     0.04
       2002  |       0.10       0.05     1.88    0.06                     0.02
       2004  |       0.08       0.05     1.45    0.15                     0.02
       2006  |       0.09       0.05     1.77    0.08                     0.03
       2008  |       0.03       0.05     0.64    0.52                     0.01
       2010  |       0.03       0.05     0.50    0.62                     0.01
       2012  |       0.07       0.05     1.28    0.20                     0.02
       2014  |       0.08       0.05     1.47    0.14                     0.03
       2016  |       0.05       0.05     0.90    0.37                     0.02
             |
       _cons |       2.03       0.03    58.33    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1<36,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1<36,beta robust

Linear regression                               Number of obs     =      7,097
                                                F(46, 7050)       =      13.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0819
                                                Root MSE          =     .60308

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.02     0.64    0.52                     0.01
     realinc |       1.81       0.28     6.55    0.00                     0.09
         age |      -0.02       0.00    -5.57    0.00                    -0.40
        age2 |       0.00       0.00     5.86    0.00                     0.42
         mar |       0.26       0.02    14.91    0.00                     0.21
        educ |       0.01       0.00     4.06    0.00                     0.06
        male |      -0.09       0.02    -5.17    0.00                    -0.07
      hompop |      -0.01       0.01    -1.60    0.11                    -0.02
       white |       0.07       0.02     3.57    0.00                     0.05
             |
          is |
          1  |       0.15       0.15     1.01    0.31                     0.05
          2  |       0.11       0.15     0.74    0.46                     0.05
          3  |       0.11       0.15     0.77    0.44                     0.05
          4  |       0.09       0.15     0.63    0.53                     0.04
          5  |       0.13       0.15     0.87    0.38                     0.07
          6  |       0.07       0.17     0.44    0.66                     0.01
          7  |       0.11       0.15     0.72    0.47                     0.03
          8  |       0.11       0.15     0.74    0.46                     0.06
             |
        year |
       1974  |       0.10       0.07     1.42    0.16                     0.02
       1975  |       0.01       0.06     0.23    0.82                     0.00
       1976  |       0.10       0.07     1.49    0.14                     0.02
       1977  |       0.09       0.07     1.36    0.17                     0.02
       1978  |       0.16       0.06     2.42    0.02                     0.04
       1980  |       0.01       0.07     0.10    0.92                     0.00
       1982  |       0.03       0.06     0.42    0.67                     0.01
       1983  |       0.04       0.07     0.69    0.49                     0.01
       1984  |       0.06       0.06     1.04    0.30                     0.02
       1985  |       0.05       0.07     0.72    0.47                     0.01
       1986  |       0.07       0.07     1.13    0.26                     0.02
       1987  |       0.02       0.06     0.34    0.73                     0.01
       1988  |       0.04       0.16     0.26    0.80                     0.01
       1989  |      -0.03       0.16    -0.22    0.83                    -0.01
       1990  |      -0.01       0.16    -0.06    0.95                    -0.00
       1991  |      -0.05       0.16    -0.30    0.76                    -0.01
       1993  |      -0.02       0.16    -0.16    0.88                    -0.01
       1994  |      -0.11       0.15    -0.74    0.46                    -0.04
       1996  |      -0.04       0.15    -0.23    0.82                    -0.01
       1998  |      -0.03       0.15    -0.20    0.84                    -0.01
       2000  |      -0.02       0.15    -0.15    0.88                    -0.01
       2002  |      -0.12       0.16    -0.74    0.46                    -0.03
       2004  |      -0.11       0.16    -0.69    0.49                    -0.03
       2006  |      -0.08       0.16    -0.54    0.59                    -0.03
       2008  |      -0.07       0.16    -0.42    0.67                    -0.02
       2010  |      -0.13       0.15    -0.83    0.40                    -0.04
       2012  |      -0.01       0.15    -0.07    0.94                    -0.00
       2014  |      -0.04       0.15    -0.27    0.79                    -0.01
       2016  |      -0.10       0.15    -0.67    0.50                    -0.04
             |
       _cons |       2.07       0.09    23.59    0.00                        .
------------------------------------------------------------------------------

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1<25,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1<25,beta robust

Linear regression                               Number of obs     =      3,486
                                                F(46, 3439)       =       7.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0901
                                                Root MSE          =     .60816

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.05       0.03     1.76    0.08                     0.03
     realinc |       1.53       0.38     4.08    0.00                     0.07
         age |      -0.02       0.00    -4.73    0.00                    -0.51
        age2 |       0.00       0.00     4.98    0.00                     0.53
         mar |       0.23       0.03     9.24    0.00                     0.19
        educ |       0.01       0.00     2.62    0.01                     0.05
        male |      -0.12       0.03    -4.61    0.00                    -0.09
      hompop |       0.00       0.01     0.58    0.56                     0.01
       white |       0.11       0.03     3.64    0.00                     0.07
             |
          is |
          1  |       0.29       0.23     1.26    0.21                     0.09
          2  |       0.24       0.22     1.08    0.28                     0.12
          3  |       0.27       0.23     1.19    0.23                     0.12
          4  |       0.26       0.23     1.14    0.25                     0.12
          5  |       0.21       0.22     0.95    0.34                     0.11
          6  |       0.28       0.24     1.14    0.25                     0.04
          7  |       0.25       0.23     1.09    0.27                     0.07
          8  |       0.25       0.22     1.10    0.27                     0.13
             |
        year |
       1974  |       0.16       0.09     1.71    0.09                     0.04
       1975  |      -0.08       0.09    -0.83    0.40                    -0.02
       1976  |       0.16       0.10     1.60    0.11                     0.04
       1977  |       0.13       0.10     1.30    0.19                     0.03
       1978  |       0.18       0.09     1.96    0.05                     0.05
       1980  |       0.03       0.09     0.36    0.72                     0.01
       1982  |       0.04       0.09     0.44    0.66                     0.01
       1983  |       0.05       0.10     0.47    0.64                     0.01
       1984  |       0.09       0.09     1.06    0.29                     0.02
       1985  |       0.08       0.09     0.82    0.42                     0.02
       1986  |       0.04       0.10     0.38    0.70                     0.01
       1987  |      -0.05       0.08    -0.64    0.52                    -0.02
       1988  |      -0.04       0.24    -0.16    0.87                    -0.01
       1989  |      -0.23       0.24    -0.94    0.35                    -0.06
       1990  |      -0.17       0.24    -0.71    0.48                    -0.04
       1991  |      -0.23       0.24    -0.97    0.33                    -0.07
       1993  |      -0.19       0.24    -0.81    0.42                    -0.05
       1994  |      -0.25       0.24    -1.06    0.29                    -0.09
       1996  |      -0.23       0.24    -0.96    0.34                    -0.08
       1998  |      -0.10       0.24    -0.40    0.69                    -0.03
       2000  |      -0.22       0.24    -0.94    0.35                    -0.07
       2002  |      -0.23       0.24    -0.95    0.34                    -0.06
       2004  |      -0.25       0.24    -1.05    0.30                    -0.06
       2006  |      -0.20       0.24    -0.86    0.39                    -0.07
       2008  |      -0.22       0.23    -0.93    0.35                    -0.06
       2010  |      -0.22       0.24    -0.91    0.36                    -0.06
       2012  |      -0.15       0.23    -0.62    0.54                    -0.04
       2014  |      -0.19       0.23    -0.81    0.42                    -0.06
       2016  |      -0.30       0.24    -1.26    0.21                    -0.10
             |
       _cons |       2.13       0.13    16.98    0.00                        .
------------------------------------------------------------------------------

. 

. reg swb wrkslf realinc `socDem' i.is i.year if hrs1>70,beta robust
reg swb wrkslf realinc `socDem' i.is i.year if hrs1>70,beta robust

Linear regression                               Number of obs     =     19,246
                                                F(47, 19198)      =      48.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1035
                                                Root MSE          =     .63367

------------------------------------------------------------------------------
             |               Robust
         swb |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      wrkslf |       0.01       0.02     0.71    0.48                     0.00
     realinc |       2.44       0.19    12.69    0.00                     0.10
         age |      -0.01       0.00    -9.59    0.00                    -0.42
        age2 |       0.00       0.00    11.42    0.00                     0.50
         mar |       0.32       0.01    29.69    0.00                     0.24
        educ |       0.01       0.00     7.30    0.00                     0.06
        male |      -0.06       0.01    -6.08    0.00                    -0.05
      hompop |      -0.01       0.00    -2.59    0.01                    -0.02
       white |       0.08       0.01     6.12    0.00                     0.05
             |
          is |
          1  |      -0.01       0.07    -0.10    0.92                    -0.00
          2  |      -0.01       0.07    -0.08    0.94                    -0.00
          3  |       0.02       0.07     0.24    0.81                     0.01
          4  |      -0.02       0.07    -0.26    0.80                    -0.01
          5  |      -0.00       0.07    -0.00    1.00                    -0.00
          6  |       0.03       0.08     0.41    0.69                     0.00
          7  |      -0.04       0.07    -0.55    0.58                    -0.01
          8  |      -0.04       0.07    -0.61    0.54                    -0.02
             |
        year |
       1973  |       0.11       0.03     3.30    0.00                     0.03
       1974  |       0.08       0.03     2.55    0.01                     0.02
       1975  |       0.06       0.03     1.77    0.08                     0.01
       1976  |       0.03       0.03     1.03    0.30                     0.01
       1977  |       0.08       0.03     2.32    0.02                     0.02
       1978  |       0.10       0.03     3.24    0.00                     0.03
       1980  |       0.05       0.03     1.36    0.17                     0.01
       1982  |       0.04       0.03     1.21    0.23                     0.01
       1983  |       0.05       0.03     1.49    0.14                     0.01
       1984  |       0.09       0.04     2.40    0.02                     0.02
       1985  |       0.03       0.03     0.93    0.35                     0.01
       1986  |       0.10       0.03     2.84    0.00                     0.02
       1987  |       0.04       0.03     1.26    0.21                     0.01
       1988  |       0.12       0.07     1.72    0.09                     0.03
       1989  |       0.07       0.07     1.00    0.32                     0.02
       1990  |       0.13       0.07     1.77    0.08                     0.03
       1991  |       0.09       0.07     1.20    0.23                     0.02
       1993  |       0.04       0.07     0.52    0.60                     0.01
       1994  |       0.01       0.07     0.12    0.91                     0.00
       1996  |       0.10       0.07     1.39    0.16                     0.03
       1998  |       0.07       0.07     1.05    0.30                     0.02
       2000  |       0.06       0.07     0.86    0.39                     0.02
       2002  |       0.04       0.07     0.59    0.55                     0.01
       2004  |       0.02       0.07     0.31    0.76                     0.00
       2006  |       0.06       0.07     0.84    0.40                     0.02
       2008  |       0.01       0.07     0.11    0.91                     0.00
       2010  |      -0.02       0.07    -0.27    0.79                    -0.01
       2012  |      -0.00       0.07    -0.03    0.97                    -0.00
       2014  |      -0.01       0.07    -0.17    0.86                    -0.00
       2016  |      -0.06       0.07    -0.80    0.42                    -0.02
             |
       _cons |       1.97       0.05    38.95    0.00                        .
------------------------------------------------------------------------------

. 
